app/Controllers/EspecialidadController.php

    public function editar($id)
    {
        $especialidadModel = new EspecialidadModel();
        $carreraModel = new CarrerasModel();
        $data['Carreras'] = $carreraModel->findAll();
---
SELECT *
FROM `carrera`