app/Controllers/Home.php

SELECT *
FROM `estudiante`
SELECT *
FROM `carrera`
---
    public function crearEstudiantes()
    {
        $estudianteModel = new EstudiantesModel();
        $carreraModelo = new CarrerasModel();
        //asignas a una posicion en el array la informacion que deseas
        $data['Estudiantes'] = $estudianteModel->findAll();
        $data['Carreras'] = $carreraModelo->findAll();

SELECT *
FROM `especialidad`
SELECT *
FROM `carrera`
---
    public function crearEspecialidad()
    {
        $especialidadModel = new EspecialidadModel();
        $carreraModelo = new CarrerasModel();
        //asignas a una posicion en el array la informacion que deseas
        $data['especialidad'] = $especialidadModel->findAll();
        $data['Carreras'] = $carreraModelo->findAll();